##############################################################
# $Id: del_zh.pl,v 1.1 2001/10/16 01:09:36 heaven Exp $
#
# del_zh.pl	將校勘條目檔當中的簡單標記經文去除
#
# 本程式二支為一套
#
# add_zh.pl 由舊的校勘條目產生新的校勘條目, 並且在有梵巴卻沒中文的條目上,
#           附上原始經文, 提供選擇, 以便插入校勘條目中.
# del_zh.pl 將處理好的校勘條目當中額外的資料刪除, 也就是簡單標記的經文, 
#           其特色是每一行首都是 <z> 開頭
#
# 使用法: 主要要修改下列二個參數
#   
#         $infile : 含有簡單標記經文的校勘條目檔的位置
#
#         $outfile : 要輸出的新的校勘條目檔
##############################################################

use strict;

#-------------------------------------------
# 可修改的變數
#-------------------------------------------

my $vol = "T01";

my $infile = "${vol}notenew.txt";				# 校勘條目檔
my $outfile = "${vol}note_ok.txt";			# 基本輸出結果檔

#-------------------------------------------
# 無需修改的參數
#
# 檔案 handle
#-------------------------------------------

local *IN;
local *OUT;

##############################################################################
#  主 程 式
##############################################################################

open IN, $infile || die "open $infile error";
open OUT, ">$outfile" || die "open $outfile error";

while(<IN>)
{
	next if /^<z>/;
	print OUT;
}

close IN;
close OUT;


############### end #######################