######################################################
# prechecknote
# $Id: prechecknote.pl,v 1.20 2002/08/23 06:01:58 heaven Exp $  
# checknote 的前置作業程式, 主要工作
# 1.將【三】換成【宋】【元】【明】
# 2.將梵巴版本前面的～改成 <e> , 若不確定的就改成 <?e>
# 3.處理明校訛的問題
# 4.只有羅馬轉寫字的, 通通前面加上 ●<sp>
# 5.可能是 <n> 的, 在前面加上●<n>
#   若有逗點的, 表示有其它組, 則加上 ●<m,>
#   若是在中間出現的, 則該組使用 ●<m>
# 6.有 cf. 在前面加上 ●<f>, cf. 在中間則加上 ●<f中>
# 7.梵缺【甲】加上 <n>
# 8.以上梵第xx 品  加上 <n>
# 9.以下第四十四頌    加上 <n>
# 10.芬＝分【三】【敦】，流布本亦同
#    變成 芬＝分【三】【敦】【流布本】，<o>芬＝分【三】【敦】，流布本亦同
# 11.沒有版本的就加上▲<n>
#     例:   法華經第五涌出品
# 12.只要有二個日本略符[力]  "ロ"(C7A7), "ろ"(C6F1), 就加上 <n>
# 13.如果是單獨一組日文略符, 則和上一組校勘相同
# 14.有修改的版本就變成 [Ａ>Ｂ]，<o>Ａ
######################################################

# 可修改的參數

$infile = "T18校勘條目.txt";		# 輸入檔
$outfile = "T18precheck.txt";		# 輸出檔

# 如果要使用▲<n>, 底下就設為 1 , 否則就設為 0
$use_3n = 1;

######################################################

# my $roma = '(?:(?:(?:[0-9a-zA-Z\.\-~`\(\)\^\[\]\'\"\;,\? <>])|(?:°)|(?:～))+(?:\xa1\x5d.*?\s?\xa1\x5e)?)';	# 羅馬轉寫字
my $roma = '(?:(?:(?:[a-zA-Z\.\-~`\(\)\^\[\]\'\"\;\? <>])|(?:°)|(?:～))+)';	# 羅馬轉寫字
my $cnum = '(?:(?:一)|(?:二)|(?:三)|(?:\xa5\x7c)|(?:五)|(?:六)|(?:七)|(?:八)|(?:九)|(?:十)|(?:廿)|(?:卅)|(?:百))';	# 中文數字
my $big5='(?:(?:[\x80-\xff][\x00-\xff])|(?:[\x00-\x7f]))';

my $orig;
my $add_orig = 0;	# 如果變成 1 , 就要加 <o>$orig

open IN, $infile;
open OUT, ">$outfile";

while(<IN>)
{
	chomp;
	if (/^(\s*(?:◎)?(?:\d+)\s*)(.*)/){
		$head = $1;
		$_ = $2;
		$orig = $2;
	}else{
		print OUT $_ . "\n";
		next;
	}
	
	if(/^<n>/ or /<o>/ or /<oo>/ or /<c>/ or /<y>/)	# 不用玩了.
	{
		$_ = $head . $_ . "\n";
		print OUT;
		next;
	}
	
	# 1.將【三】換成【宋】【元】【明】

	#s/【三】＊/【宋】＊【元】＊【明】＊/g;
	#s/【三】下同/【宋】下同【元】下同【明】下同/g;
	#s/【三】/【宋】【元】【明】/g;
	
	# 2.將梵巴版本前面的～改成 <e> , 若不確定的就改成 <?e>
	
	$_ = check_equ($_);
	$_ = check_equ1($_);
	$_ = check_equ2($_);

	s/<\?tmp\?>/～/;
	s/<\?e><\?e>/<\?e>/;
	s/<\?e><e>/<e>/;

	# 3.處理明校訛的問題
	
	if (/^(明校.*)/)		# 明字開頭的字
	{
		$tail = "";
		if(/(明校.*?\s*)(，.*)/)
		{
			$_ = $1;
			$tail = $2;
		}
		$_ = check_min($_);
		$_ = $_ . $tail;
	}
	
	# 4.只有羅馬轉寫字的, 通通前面加上 ●<sp>

	if (/^($roma)$/)		# 純羅馬轉寫字
	{
		if($_ !~ /^(?:<|(?:～))/)	# 標過的就不要標
		{
			$tmp = $_;
			$tmp =~ s/\(\?\)//g;
			if($tmp !~ /[\(\)]/)		# 只要有 ( 或 ) 就不行
			{
				if( $_ !~ /(?:Samp\.)|(?:Sumv\.)/i)	# 不可以有 Samp. Sumv.
				{
					$_ = "●<sp>$_";
				}
			}
		}
	}

	# 5.可能是 <n> 的, 在前面加上●<n>
	#   若有逗點的, 表示有其它組, 則加上 ●<m,>
	#   若是在中間出現的, 則該組使用 ●<m>

	@keyword = (
		'忍澂師校刻本曰',
		'(?:..本)?冠註曰',
		'..本頭註(?:..書)?曰',
		'..本朱註曰',
		'..本朱注曰',
		'..本朱書(?:傍註)?曰',
		'原本卷末註曰',
		'..本傍註朱筆曰',
		'..本傍註朱書曰',
		'【原】',
		'此下聖本有光明皇后願文',
		'..本奧書曰',
		".*?\Q新加\E",
		'.*?字論作'
	);
	
	foreach $keyword (@keyword)
	{
		if (/^$keyword.*/)
		{
			if(/，/)
			{
				$_ = "●<m,>$_";
			}
			else
			{
				$_ = "●<n>$_";
			}
		}
		
		s/，($keyword)/，●<m>$1/g;
	}
	
	# 6.有 cf. 在前面加上 ●<f>	
	
	if (/^(?:（)?cf\..*/i)
	{
		if($_ !~ /^<f>/)
		{
			$_ = "●<f>$_";
		}
	}
	elsif (/^.*cf\..*/i)
	{
		if($_ !~ /^<f>/)
		{
			$_ = "●<f中>$_";		# cf. 出現在中間
		}
	}

	# 7.梵缺【甲】加上 <n>
	
	if (/^梵缺【.*/)
	{
		$_ = "●<n>$_";
	}

	# 8.以上梵第xx 品加上 <n>
	
	if (/^以((上)|(下))梵第.*/)
	{
		$_ = "●<n>$_";
	}
	
	# 9.以下第四十四頌    加上 <n>
	
	if (/^(以((上)|(下))?)?第($cnum)+\Q頌\E.*/)
	{
		if(/，/)
		{
			$_ = "●<m,>$_";
		}
		else
		{
			$_ = "●<n>$_";
		}
	}	

	# 10.芬＝分【三】【敦】，流布本亦同
	#    變成 芬＝分【三】【敦】【流布本】，<o>芬＝分【三】【敦】，流布本亦同

	if (/^(.*】)，流布本亦同$/)
	{
		$_ = "$1【流布本】，<o>$_";
	}

	# 11.沒有版本的就加上▲<n>
	#     例:   法華經第五涌出品  
	
	if($use_3n)
	{
		if(($_ !~ /【/) and ($_ !~ /</) and ($_ !~ /～/) and ($_ !~ /？/))
		{
			$_ = "▲<n>" . $_;
		}
	}
	
	#12.只要有二個日本略符[力]  "⑨"(C7F1), "ろ"(C6F1), 就加上 <n>
	
	if(/((⑨)|(ろ)).*?((⑨)|(ろ))/)
	{
		if($_ !~ /^<n>/)
		{
			$_ = "●<n>" . $_;
		}
	}
	
	# 13.如果是單獨一組日文略符, 則和上一組校勘相同
	
	if(/(^.*，)(.*?)(【.*?】，)((?:ュ)|(?:ゅ)|(?:⑨)|(?:ろ))(【.*?】.*$)/)	# 日文在第三組或更後面
	{
		my $t1 = $1;
		my $t2 = $2;
		my $t3 = $3;
		my $t4 = $4;
		my $t5 = $5;

		$_ = "${t1}${t2}${t3}${t2}${t4}${t5}";
		$add_orig = 1;
	}
	elsif(/^(.*?)(【.*?】，)((?:ュ)|(?:ゅ)|(?:⑨)|(?:ろ))(【.*?】.*$)/)	# 日文在第二組
	{
		my $t1 = $1;
		my $t2 = $2;
		my $t3 = $3;
		my $t4 = $4;

		$_ = "${t1}${t2}${t1}${t3}${t4}";
		$add_orig = 1;
	}

	# 14.有修改的版本就變成 [Ａ>Ｂ]，<o>Ａ
	
	my $tmporig = get_corr_right($orig);
	#if($tmporig ne $orig)
	#{
		# 因為不同, 所以換定了.
	#	$add_orig = 1;
	#}
	$orig = $tmporig;

	# 還原	#############################################
	
	if($add_orig == 1)
	{
		$_ = $head . $_ . "，<o>${orig}\n";
		$add_orig = 0;
	}
	else
	{
		$_ = $head . $_ . "\n";
	}
	print OUT;
}

close IN;
close OUT;

######################################################

sub check_min
{
	local $_ = shift;

	return $_ if(s/(明校(?:(?:\[言\*為\]曰)|(?:訛曰)|(?:異))(.*?)當作(.*))/<mg><sic corr="$3" resp="【明】" orig="$1">$2<\/sic>/) ;
	return $_ if(s/(明校(?:(?:\[言\*為\]曰)|(?:訛曰)|(?:異))(.*?)應作(.*))/<mg><sic corr="$3" resp="【明】" orig="$1">$2<\/sic>/) ;
	return $_ if(s/(明校(?:(?:\[言\*為\]曰)|(?:訛曰)|(?:異))(.*?)疑作(.*))/<mg><sic corr="$3" resp="【明】" orig="$1">$2<\/sic>/) ;
	return $_ if(s/(明校(?:(?:\[言\*為\]曰)|(?:訛曰)|(?:異))(.*?)當(.*))/<mg><sic corr="$3" resp="【明】" orig="$1">$2<\/sic>/) ;
	return $_ if(s/(明校(?:(?:\[言\*為\]曰)|(?:訛曰)|(?:異))(.*?)應(.*))/<mg><sic corr="$3" resp="【明】" orig="$1">$2<\/sic>/) ;
	return $_ if(s/(明校(?:(?:\[言\*為\]曰)|(?:訛曰)|(?:異))(.*?)作(.*))/<mg><sic corr="$3" resp="【明】" orig="$1">$2<\/sic>/) ;

	return $_;
}

sub check_equ
{
	local $_ = shift;

	s/((?:，)|(?:^\s*))～(A\.\s+[IVX\.\d,]+)/$1<e>$2/;
	s/((?:，)|(?:^\s*))～(Ud.\s+[IVX\.\d,]+)/$1<e>$2/;
	s/((?:，)|(?:^\s*))～(It\.\s+[IVX\.\d,]+)/$1<e>$2/;
	s/((?:，)|(?:^\s*))～(Kh\.\s+[IVX\.\d,]+)/$1<e>$2/;
	s/((?:，)|(?:^\s*))～(Jaa\.\s+[IVX\.\d,]+)/$1<e>$2/;
	s/((?:，)|(?:^\s*))～(Th\.\s+[IVX\.\d,]+)/$1<e>$2/;
	s/((?:，)|(?:^\s*))～(D\.\s+[IVX\.\d,]+)/$1<e>$2/;
	s/((?:，)|(?:^\s*))～(Dh\.\s+[IVX\.\d,]+)/$1<e>$2/;
	s/((?:，)|(?:^\s*))～(Nd\.\s+[IVX\.\d,]+)/$1<e>$2/;
	s/((?:，)|(?:^\s*))～(Pv\.\s+[IVX\.\d,]+)/$1<e>$2/;
	s/((?:，)|(?:^\s*))～(Bv\.\s+[IVX\.\d,]+)/$1<e>$2/;
	s/((?:，)|(?:^\s*))～(M\.\s+[IVX\.\d,]+)/$1<e>$2/;
	s/((?:，)|(?:^\s*))～(Vin\.\s+[IVX\.\d,]+)/$1<e>$2/;
	s/((?:，)|(?:^\s*))～(Vv\.\s+[IVX\.\d,]+)/$1<e>$2/;
	s/((?:，)|(?:^\s*))～(S\.\s+[IVX\.\d,]+)/$1<e>$2/;
	s/((?:，)|(?:^\s*))～(Sn\.\s+[IVX\.\d,]+)/$1<e>$2/;
	s/((?:，)|(?:^\s*))～(Sumv\.\s+[IVX\.\d,]+)/$1<e>$2/;
	s/((?:，)|(?:^\s*))～(Samp\.\s+[IVX\.\d,]+)/$1<e>$2/;

	return $_;
}

sub check_equ1
{
	local $_ = shift;

	# <?tmp?> 最後會換回 ～
	s/((?:，)|(?:^\s*))(\S.*?)～(A\.\s+)/$1<?e>$2<?tmp?>$3/;
	s/((?:，)|(?:^\s*))(\S.*?)～(Ud.\s+)/$1<?e>$2<?tmp?>$3/;
	s/((?:，)|(?:^\s*))(\S.*?)～(It\.\s+)/$1<?e>$2<?tmp?>$3/;
	s/((?:，)|(?:^\s*))(\S.*?)～(Kh\.\s+)/$1<?e>$2<?tmp?>$3/;
	s/((?:，)|(?:^\s*))(\S.*?)～(Jaa\.\s+)/$1<?e>$2<?tmp?>$3/;
	s/((?:，)|(?:^\s*))(\S.*?)～(Th\.\s+)/$1<?e>$2<?tmp?>$3/;
	s/((?:，)|(?:^\s*))(\S.*?)～(D\.\s+)/$1<?e>$2<?tmp?>$3/;
	s/((?:，)|(?:^\s*))(\S.*?)～(Dh\.\s+)/$1<?e>$2<?tmp?>$3/;
	s/((?:，)|(?:^\s*))(\S.*?)～(Nd\.\s+)/$1<?e>$2<?tmp?>$3/;
	s/((?:，)|(?:^\s*))(\S.*?)～(Pv\.\s+)/$1<?e>$2<?tmp?>$3/;
	s/((?:，)|(?:^\s*))(\S.*?)～(Bv\.\s+)/$1<?e>$2<?tmp?>$3/;
	s/((?:，)|(?:^\s*))(\S.*?)～(M\.\s+)/$1<?e>$2<?tmp?>$3/;
	s/((?:，)|(?:^\s*))(\S.*?)～(Vin\.\s+)/$1<?e>$2<?tmp?>$3/;
	s/((?:，)|(?:^\s*))(\S.*?)～(Vv\.\s+)/$1<?e>$2<?tmp?>$3/;
	s/((?:，)|(?:^\s*))(\S.*?)～(S\.\s+)/$1<?e>$2<?tmp?>$3/;
	s/((?:，)|(?:^\s*))(\S.*?)～(Sn\.\s+)/$1<?e>$2<?tmp?>$3/;
	s/((?:，)|(?:^\s*))(\S.*?)～(Sumv\.\s+)/$1<?e>$2<?tmp?>$3/;
	s/((?:，)|(?:^\s*))(\S.*?)～(Samp\.\s+)/$1<?e>$2<?tmp?>$3/;

	return $_;
}


sub check_equ2
{
	local $_ = shift;

	s/～(A\.\s+)/<?e>$1/;
	s/～(Ud.\s+)/<?e>$1/;
	s/～(It\.\s+)/<?e>$1/;
	s/～(Kh\.\s+)/<?e>$1/;
	s/～(Jaa\.\s+)/<?e>$1/;
	s/～(Th\.\s+)/<?e>$1/;
	s/～(D\.\s+)/<?e>$1/;
	s/～(Dh\.\s+)/<?e>$1/;
	s/～(Nd\.\s+)/<?e>$1/;
	s/～(Pv\.\s+)/<?e>$1/;
	s/～(Bv\.\s+)/<?e>$1/;
	s/～(M\.\s+)/<?e>$1/;
	s/～(Vin\.\s+)/<?e>$1/;
	s/～(Vv\.\s+)/<?e>$1/;
	s/～(S\.\s+)/<?e>$1/;
	s/～(Sn\.\s+)/<?e>$1/;
	s/～(Sumv\.\s+)/<?e>$1/;
	s/～(Samp\.\s+)/<?e>$1/;

	return $_;
}


###############################################
# 取勘誤字串的右邊那一組
###############################################

sub get_corr_right()
{
	# 這一組容許數字, 因為缺字會換成 :1: :2:
	my $loseb5='(?:(?:[\x80-\xff][\x40-\xff])|(?:&.*?;)|[\x21-\x3d]|[\x3f-\x40]|\x5c|[\x5e-\x60]|[\x7b-\x7f])';
	my $losebig5='(?:(?:[\x80-\xff][\x40-\xff])|[\x21-\x2f]|[\x3a-\x3d]|[\x3f-\x40]|\x5c|[\x5e-\x60]|[\x7b-\x7f])';
	my $data = shift;
	
	if($data =~ />/)
	{
		# 但要先換組字式
		while($data =~ /^$big5*?\[($losebig5+?)\]/)
		{
			 $data =~ s/^($big5*?)\[($losebig5+?)\]/$1:1:$2:2:/;
		}
		#數字也要換啊  V1.30
		$data =~ s/\[(\d{2,3})\]/:1:$1:2:/g;

		$data =~ s/\[($loseb5*?)>$loseb5*?\](?:<[^>]*resp[^>]*>)?/$1/g;
		$data =~ s/:1:/\[/g;
		$data =~ s/:2:/\]/g;
	}
	
	return $data;
}